<a href="https://colab.research.google.com/github/armying/armying/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Read data from csv using pandas

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('salaries_by_college_major.csv')

In [ ]:
# get the top 5 entries in the dataframe
df.head()

In [ ]:
# get the dimension of the dataframe
df.shape

In [ ]:
# get the name of the columns in the dataframe
df.columns

In [ ]:
# check if the dataframe has any NaN values(missing/junk values)
df.isna()

In [ ]:
# print the last 5 entries in the dataframe
df.tail()

In [12]:
# remove the rows with NaN entries using .dropna()
clean_df = df.dropna()

In [ ]:
# print all the rows in the column "Starting Median Salary"
clean_df['Starting Median Salary']

In [18]:
# Find the row with max value for "starting median salary" column
clean_df['Starting Median Salary'].max()

74300.0

In [20]:
# Find the row with the highest starting median salary and return its id
clean_df['Starting Median Salary'].idxmax()

43

In [24]:
# Access the cell in the "Undergraduate Major" column on the 43th row
clean_df['Undergraduate Major'].loc[43]

'Physician Assistant'

In [25]:
# Find the major with the highest startnig median salary
clean_df['Undergraduate Major'].loc[clean_df['Starting Median Salary'].idxmax()]

'Physician Assistant'

In [27]:
# Find the 10th percentile salary for major computer science
clean_df['Mid-Career 10th Percentile Salary'].loc[clean_df['Undergraduate Major'] == 'Computer Science']

13    56000.0
Name: Mid-Career 10th Percentile Salary, dtype: float64

In [29]:
# Find the undergraduate degree with highest starting salary
highest_paying_degree = clean_df['Undergraduate Major'].loc[clean_df['Starting Median Salary'].idxmax()]
print(highest_paying_degree)

Physician Assistant

In [32]:
# Find the college degree with highest median mid-career salary
clean_df['Undergraduate Major'].loc[clean_df['Mid-Career Median Salary'].idxmax()]

'Chemical Engineering'

In [37]:
# Find the college degree with the lowest Starting Salary and how much they make initially
clean_df['Starting Median Salary'].idxmin()
lowest_salary_degree = clean_df['Undergraduate Major'].loc[clean_df['Starting Median Salary'].idxmin()]
lowest_salary = clean_df['Starting Median Salary'].min()
print(f"The lowest earning degree after college is {lowest_salary_degree} and they make ${lowest_salary}")

The lowest earning degree after college is Spanish and they make $34000.0

In [ ]:
# Find the college major with the lowst MID career salary and how much they are expected to make
lowest_earning_midcareer_degree = clean_df['Undergraduate Major'].loc[clean_df['Mid-Career Median Salary'].idxmin()]
lowest_salary_midcareer = clean_df['Mid-Career Median Salary'].min()
print(f"The lowest earining major during mid career is {lowest_earning_midcareer_degree} and they make ${lowest_salary_midcareer}")

In [43]:
# Find the risk of each major by finding the difference between the 90th percentile and 10th percentile salary
# Pandas allow for arithmetic between columns
salary_dif = clean_df['Mid-Career 90th Percentile Salary'] - clean_df['Mid-Career 10th Percentile Salary']
safest_degree = clean_df['Undergraduate Major'].loc[salary_dif.idxmin()]
print(safest_degree)

Nursing

In [44]:
# Add a new column to the dataframe
spread = clean_df['Mid-Career 90th Percentile Salary'] - clean_df['Mid-Career 10th Percentile Salary']
clean_df.insert(1, "Spread", spread)

In [49]:
# Sort the dataframe using .sort_values()
low_risk_df = clean_df.sort_values(by="Spread", ascending=True)
low_risk_df[["Undergraduate Major", "Spread"]].head()

           Undergraduate Major   Spread
40                     Nursing  50700.0
43         Physician Assistant  57600.0
41                   Nutrition  65300.0
49                     Spanish  65400.0
27  Health Care Administration  66400.0

In [51]:
# Find the degree with the highest potential using .sort_values()
highest_potential = clean_df.sort_values(by="Mid-Career 90th Percentile Salary", ascending=False)
highest_potential[['Undergraduate Major', 'Mid-Career 90th Percentile Salary']].head()

     Undergraduate Major  Mid-Career 90th Percentile Salary
17             Economics                           210000.0
22               Finance                           195000.0
8   Chemical Engineering                           194000.0
37                  Math                           183000.0
44               Physics                           178000.0

In [52]:
# Majors with the greatest spread in salary
greatest_spread = clean_df.sort_values(by="Spread", ascending=False)
greatest_spread[['Undergraduate Major', "Spread"]].head()

   Undergraduate Major    Spread
17           Economics  159400.0
22             Finance  147800.0
37                Math  137800.0
36           Marketing  132900.0
42          Philosophy  132500.0

In [55]:
# Group the rows together based on particular column using .groupby()
clean_df.groupby(by="Group").count()

          Undergraduate Major  ...  Mid-Career 90th Percentile Salary
Group                          ...
Business                   12  ...                                 12
HASS                       22  ...                                 22
STEM                       16  ...                                 16

[3 rows x 6 columns]

In [57]:
# Find the average salary of each group: Business, HASS, STEM
clean_df.groupby(by="Group").mean()

                 Spread  ...  Mid-Career 90th Percentile Salary
Group                    ...
Business  103958.333333  ...                      147525.000000
HASS       95218.181818  ...                      129363.636364
STEM      101600.000000  ...                      157625.000000

[3 rows x 5 columns]

In [58]:
# Tell pandas to print numbers upto 2 decimal places
pd.options.display.float_format = '{:,.2f}'.format

In [59]:
clean_df.groupby("Group").mean()

             Spread  ...  Mid-Career 90th Percentile Salary
Group                ...
Business 103,958.33  ...                         147,525.00
HASS      95,218.18  ...                         129,363.64
STEM     101,600.00  ...                         157,625.00

[3 rows x 5 columns]